In [40]:
import pandas as pd

In [41]:
#series de pandas
numeros= [1,2,3,4,5,6,7,8,9,10]
series= pd.Series(numeros)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [42]:
data =  {
    "nombre": ["Ana", "Pedro", "Luis"],
      "edad": [21, 22, 23] ,
      "ciudad": ["Lima", "Arequipa", "Trujillo"]
      }
print(data), type(data)

{'nombre': ['Ana', 'Pedro', 'Luis'], 'edad': [21, 22, 23], 'ciudad': ['Lima', 'Arequipa', 'Trujillo']}

(None, dict)

In [43]:
#Generar DataFrame
df = pd.DataFrame(data)
df

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo

In [44]:
#exportar DATA FRAME
df.to_csv("data.csv")

In [45]:
#importar DATA FRAME
import_df = pd.read_csv("data.csv", index_col=0)
import_df.head()

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo

In [46]:
#SELECIONAR UNA COLUMNA
import_df["nombre"]

0      Ana
1    Pedro
2     Luis
Name: nombre, dtype: object

In [47]:
df[["nombre", "ciudad","edad"]]

  nombre    ciudad  edad
0    Ana      Lima    21
1  Pedro  Arequipa    22
2   Luis  Trujillo    23

In [48]:
fila = df.loc[0]
fila

nombre     Ana
edad        21
ciudad    Lima
Name: 0, dtype: object

In [49]:
df[(df["edad"] >= 20) & (df["edad"] < 22)]

  nombre  edad ciudad
0    Ana    21   Lima

In [50]:
33.50
filtro= (df["ciudad"].str.lower().str.startswith("t"))
print(df)
print("-----------------")
print(filtro)

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo
-----------------
0    False
1    False
2     True
Name: ciudad, dtype: bool

In [53]:
df.query("edad > 20 & ciudad == 'Lima'")

  nombre  edad ciudad
0    Ana    21   Lima

In [62]:
# df[df["ciudad"].isin(["Lima","Trujillo","pure"])]
df[df["edad"].isin([21,30,23])]

  nombre  edad    ciudad
0    Ana    21      Lima
2   Luis    23  Trujillo

In [71]:
import numpy as np

In [72]:
datax={
    "Nombre" :["PePE", "jORGE", "jULIAN"],
    "City": ["Lima", "Arequipa", None],
    "Edad": [np.nan, 23, 22],
}
df= pd.DataFrame(datax)
df

   Nombre      City  Edad
0    PePE      Lima   NaN
1   jORGE  Arequipa  23.0
2  jULIAN      None  22.0

In [75]:
#rellenar datos vacios
df_fill= df.fillna(
    {
        "Edad" : df["Edad"].mean(),
        "City" : "Desconocido"
    }
)
df_fill

   Nombre         City  Edad
0    PePE         Lima  22.5
1   jORGE     Arequipa  23.0
2  jULIAN  Desconocido  22.0

In [80]:
#Eliminar valores vacios
df_drop= df.dropna()
df_drop

  Nombre      City  Edad
1  jORGE  Arequipa  23.0

In [ ]:
#remplazar datos de una columna
df_replace= df.replace(
    {
        "City": {
            None: "Desconocido"
        }
    }
)
df_replace

   Nombre      City  Edad
0    PePE      Lima   NaN
1   jORGE  Arequipa  23.0
2  jULIAN      None  22.0